FILES/DataProcessors/ПомощникПервогоЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПервогоЗапуска</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

FILES/InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НаборХарактеристикСистемный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикСистемный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ОписаниеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширенныйОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/РеквизитыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЮрАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/РеквизитыКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыКонтрагента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЮрАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Enums/ТипыДополнительногоФункционала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыДополнительногоФункционала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомпонентСобытий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентЗагрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентВыгрузкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентПечатнойФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпонентОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Системный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Enums/ТипДочернейУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипДочернейУслуги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загруженная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Documents/Услуга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Услуга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияПоКомандировкам</xr:Item>
				<xr:Item>AccumulationRegister.ИнформацияПоСуммамУслуги</xr:Item>
				<xr:Item>InformationRegister.СвязанныеУслуги</xr:Item>
				<xr:Item>InformationRegister.КомиссииАгентств</xr:Item>
				<xr:Item>InformationRegister.РеквизитыХарактеристикаНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ИнформацияПоУслугеЭкстраполя</xr:Item>
				<xr:Item>InformationRegister.ХарактеристикаНоменклатурыРасшифровка</xr:Item>
				<xr:Item>InformationRegister.ПредставлениеКомандируемыхВУслугах</xr:Item>
				<xr:Item>InformationRegister.ИнформацияПоУслуге</xr:Item>
				<xr:Item>InformationRegister.УслугиДляЗаказовИзКорзины</xr:Item>
				<xr:Item>InformationRegister.ИсторияКомандированных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложеноВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСПоставщиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказИзКорзины</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДочернейУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДочернейУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВладелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Командируемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Командируемый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭкстраПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляЭкстраПолей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляЭкстраПолей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FILES/DataProcessors/ПомощникПервогоЗапуска/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьКлючиХарактеристикНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаборХарактеристикДляНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.НаборХарактеристикДляНоменклатуры КАК НаборХарактеристикДляНоменклатуры
	               |ГДЕ
	               |	НаборХарактеристикДляНоменклатуры.ЭтоГруппа = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НаборХарактеристикДляЭкстраПолей.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.НаборХарактеристикДляЭкстраПолей КАК НаборХарактеристикДляЭкстраПолей
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НаборХарактеристикДляКонтрагента.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.НаборХарактеристикДляКонтрагента КАК НаборХарактеристикДляКонтрагента
	               |ГДЕ
	               |	НаборХарактеристикДляКонтрагента.ЭтоГруппа = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НаборХарактеристикСистемный.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.НаборХарактеристикСистемный КАК НаборХарактеристикСистемный";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектСсылки = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСсылки.Записать();
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючиХарактеристик(Команда)
	ЗаполнитьКлючиХарактеристикНаСервере();
	
	Сообщить("Обновление ключей завершено");	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМестаИзКлассификатораНаСервере()
	
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьМестаСтатика();
	
	Сообщить("Загрузка мест завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМестаИзКлассификатора(Команда)
	ЗагрузитьМестаИзКлассификатораНаСервере();
КонецПроцедуры





&НаСервере
Процедура ПереходV2вV3НаСервере(ЧтоПоменять= "Ю_", НаЧтоПоменять= "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФункцииОписания.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФункцииОписания КАК ФункцииОписания
		|ГДЕ
		|	ФункцииОписания.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		ОбъектЗаписи = Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.КодФункции = СтрЗаменить(ОбъектЗаписи.КодФункции, ЧтоПоменять, НаЧтоПоменять);
		ОбъектЗаписи.Записать();
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементОтбора.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементОтбора КАК ЭлементОтбора
		|ГДЕ
		|	ЭлементОтбора.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		ОбъектЗаписи = Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Условие = СтрЗаменить(ОбъектЗаписи.Условие, ЧтоПоменять, НаЧтоПоменять);
		ОбъектЗаписи.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементСвязаннойНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементСвязаннойНоменклатуры КАК ЭлементСвязаннойНоменклатуры";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		ОбъектЗаписи = Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Условие = СтрЗаменить(ОбъектЗаписи.Условие, ЧтоПоменять, НаЧтоПоменять);
		ОбъектЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходV2вV3(Команда)
	ПереходV2вV3НаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьОшибкиНаСервере()
	ПереходV2вV3НаСервере("УслугаПриминения", "УслугаПрименения");
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьОшибки(Команда)
	ИсправитьОшибкиНаСервере();
КонецПроцедуры





&НаСервере
Процедура ЗаполнитьСтавкиНДСНаСервере()
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьСтавкиНДС();
	
	Сообщить("Загрузка СтавокНДС завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкиНДС(Команда)
	ЗаполнитьСтавкиНДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеФункцииНаСервере()
	Справочники.ФункцииОписания.ЗагрузитьПредопределенныеЗначения();
	
	Сообщить("Загрузка предопределенных функций завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенныеФункции(Команда)
	ЗаполнитьПредопределенныеФункцииНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьПредопределенныеХарактеристикиНоменклатурыНаСервере()
	ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры.ЗагрузитьПредопределенныеЗначения();
	
	Сообщить("Загрузка предопределенных характеристик завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенныеХарактеристикиНоменклатуры(Команда)
	ЗаполнитьПредопределенныеХарактеристикиНоменклатурыНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСистемныеХарактеристикиНаСервере()
	
	Система = РегистрыСведений.НастройкиСистемы.СоздатьМенеджерЗаписи();
	Система.Характеристика = ПланыВидовХарактеристик.НаборХарактеристикСистемный.КонфигурацияДонор;
	Система.Значение = Метаданные.Имя;
	Система.Записать(Истина);
	
	РегистрыСведений.НастройкиСистемы.ЗагрузитьПредопределенныеЗначения();
	
	Сообщить("Загрузка системных характеристик завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСистемныеХарактеристики(Команда)
	ЗаполнитьСистемныеХарактеристикиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбработчикиСобытияНаСервере()
	РегистрыСведений.СобытияОбъектов.ЗагрузитьПредопределенныеЗначения();
	Сообщить("Загрузка обработчиков событий завершена");	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбработчикиСобытия(Команда)
	СоздатьОбработчикиСобытияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОписанияНоменклатурыБТНаСервере()
	РегистрыСведений.ОписаниеНоменклатуры.ЗагрузитьПредопределенныеЗначения();
	Сообщить("Загрузка описаний номенклатур БТ завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОписанияНоменклатурыБТ(Команда)
	ЗаполнитьОписанияНоменклатурыБТНаСервере();
КонецПроцедуры






&НаСервере
Процедура ЗаполнитьНоменклатурыБТНаСервере()
	Справочники.НоменклатураБТ.ЗагрузитьПредопределенныеЗначения();
	Сообщить("Загрузка номенклатур БТ завершена");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатурыБТ(Команда)
	ЗаполнитьНоменклатурыБТНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИдентификаторыНаСервере()
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(Истина,Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификаторы(Команда)
	ОбновитьИдентификаторыНаСервере();
КонецПроцедуры




&НаКлиенте
Процедура ВыполнитьПолнуюЗагрузку(Команда)
	ЗаполнитьКлючиХарактеристик(Команда);
	ЗагрузитьМестаИзКлассификатора(Команда);
	ЗаполнитьСтавкиНДС(Команда);
	ЗаполнитьПредопределенныеФункции(Команда);
	ЗаполнитьПредопределенныеХарактеристикиНоменклатуры(Команда);
	ЗаполнитьНоменклатурыБТ(Команда);
	ЗаполнитьСистемныеХарактеристики(Команда);
	СоздатьОбработчикиСобытия(Команда);	
	ЗаполнитьОписанияНоменклатурыБТ(Команда);
	ОбновитьИдентификаторы(Команда);
	ЗагрузитьМестаИзКлассификатора_ЖД(Команда);
	ЗагрузитьИзКлассификатора_Авиакомпании(Команда);
КонецПроцедуры

&НаСервере
Процедура СкопироватьРеквизитыОрганизацийНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОрганизацииКонтактнаяИнформация.Ссылка КАК Организация,
	               |	ОрганизацииКонтактнаяИнформация.Представление КАК ПредставлениеАдреса
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |ГДЕ
	               |	ОрганизацииКонтактнаяИнформация.Вид = &Вид";
	Сч = 1;
	Пока Сч <=2 Цикл 
		Если Сч = 1 Тогда
			Выполнить("Запрос.УстановитьПараметр(""Вид"",  Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации)");
		Иначе
			Выполнить("Запрос.УстановитьПараметр(""Вид"",  Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации)");		    
		КонецЕсли;
		ТаблицаАдресов = Запрос.Выполнить().Выгрузить();
		Для Каждого ТекОрг из ТаблицаАдресов Цикл
			НаборЗаписей = РегистрыСведений.РеквизитыОрганизации.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(ТекОрг.Организация);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Организация =  ТекОрг.Организация;
				Если Сч = 1 Тогда
					НоваяЗапись.ЮрАдрес = ТекОрг.ПредставлениеАдреса;
				Иначе
				    НоваяЗапись.ПочтАдрес = ТекОрг.ПредставлениеАдреса;
				КонецЕсли;  
			Иначе
				Для Каждого ТекЗапись Из НаборЗаписей Цикл 				
					Если Сч = 1 Тогда
						ТекЗапись.ЮрАдрес = ТекОрг.ПредставлениеАдреса;
					Иначе
					    ТекЗапись.ПочтАдрес = ТекОрг.ПредставлениеАдреса;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		Сч = Сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРеквизитыОрганизаций(Команда)
	СкопироватьРеквизитыОрганизацийНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкопироватьРеквизитыКонтрагентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК ПредставлениеАдреса
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Вид = &Вид";
	Сч = 1;
	Пока Сч <=2 Цикл 
		Если Сч = 1 Тогда
			Выполнить("Запрос.УстановитьПараметр(""Вид"",  Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)");			
		Иначе
			Выполнить("Запрос.УстановитьПараметр(""Вид"",  Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента)");		    
		КонецЕсли;
		ТаблицаАдресов = Запрос.Выполнить().Выгрузить();
		Для Каждого ТекОрг из ТаблицаАдресов Цикл
			НаборЗаписей = РегистрыСведений.РеквизитыКонтрагента.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(ТекОрг.Контрагент);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Контрагент =  ТекОрг.Контрагент;
				Если Сч = 1 Тогда
					НоваяЗапись.ЮрАдрес = ТекОрг.ПредставлениеАдреса;
				Иначе
				    НоваяЗапись.ПочтАдрес = ТекОрг.ПредставлениеАдреса;
				КонецЕсли;  
			Иначе
				Для Каждого ТекЗапись Из НаборЗаписей Цикл 				
					Если Сч = 1 Тогда
						ТекЗапись.ЮрАдрес = ТекОрг.ПредставлениеАдреса;
					Иначе
					    ТекЗапись.ПочтАдрес = ТекОрг.ПредставлениеАдреса;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		Сч = Сч + 1; 
	КонецЦикла;      
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРеквизитыКонтрагентов(Команда)
	СкопироватьРеквизитыКонтрагентовНаСервере();
КонецПроцедуры



&НаСервере
Процедура НормализацияМПНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныйФункционал.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДополнительныйФункционал КАК ДополнительныйФункционал
	               |ГДЕ
	               |	ДополнительныйФункционал.ТипДопФункционала = ЗНАЧЕНИЕ(Перечисление.ТипыДополнительногоФункционала.КомпонентСобытий)";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСоСсылкой ИЗ Выгрузка Цикл
		ОбъектМП = СтрокаСоСсылкой.Ссылка.ПолучитьОбъект();
		ОбъектМП.ЗаполнитьСписокОбрабатываемыхСобытий();
		ОбъектМП.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НормализацияМП(Команда)
	НормализацияМПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеВУслугахТипаДочернейУслугиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуга.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Услуга КАК Услуга
	               |ГДЕ
	               |	Услуга.УслугаВладелец <> ЗНАЧЕНИЕ(Документ.Услуга.ПустаяСсылка)
	               |	И Услуга.ТипДочернейУслуги = ЗНАЧЕНИЕ(Перечисление.ТипДочернейУслуги.ПустаяСсылка)";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСоСсылкой ИЗ Выгрузка Цикл
		ОбъектМП = СтрокаСоСсылкой.Ссылка.ПолучитьОбъект();
		ОбъектМП.ТипДочернейУслуги = Перечисления.ТипДочернейУслуги.Автоматическая;
		ОбъектМП.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеВУслугахТипаДочернейУслуги(Команда)
	ЗаполнениеВУслугахТипаДочернейУслугиНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ЗагрузитьМестаИзКлассификатора_ЖД(Команда)
	ЗагрузитьМестаИзКлассификатораНаСервере_ЖД();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМестаИзКлассификатораНаСервере_ЖД()
	
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьМестаЖД();
	
	Сообщить("Загрузка ЖД станций завершена");	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзКлассификатора_Авиакомпании(Команда)
	ЗагрузитьИзКлассификатораНаСервере_Авиакомпании();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзКлассификатораНаСервере_Авиакомпании()
	
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьАвиакомпании();
	
	Сообщить("Загрузка авиакомпаний станций завершена");	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВидыНоменклатурНаСервере()
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьВидыНоменклатурУТ();
	Сообщить("Загрузка видов номенклатур завершена");	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВидыНоменклатур(Команда)
	ЗаполнитьВидыНоменклатурНаСервере();
КонецПроцедуры
